import React from "react";
import { Link } from "react-router-dom";
const Cookie = () => {
  window.scrollTo(0, 0);
  return (
    <div className="bg-gradient-to-b from-[#1D1D2F] via-[#30307D] to-[#6329C1] min-h-[125vh] py-12 px-4 sm:px-12">
      <div className="sticky top-8 left-0">
        <Link
          to="/"
          className="font-medium text-white underline decoration-2 underline-offset-2 cursor-pointer px-5 py-4 bg-blue-900 rounded-lg border-white/30 border-2"
        >
          กลับสู่หน้าหลัก
        </Link>
      </div>
      <div className="mt-12 max-w-[60em] mx-auto">
        <h2 className="text-center sm:text-left text-3xl text-white font-bold">
          Cookies คืออะไร ?
        </h2>
        <p className="sm:text-lg text-white/80 mt-4">
          Cookies คือ text files ที่อยู่ในคอมพิวเตอร์ของท่าน
          ใช้เพื่อจัดเก็บรายละเอียดข้อมูล log การใช้งานอินเตอร์เน็ตของท่าน หรือ
          พฤติกรรมการเยี่ยมชมเว็บไซต์ของท่าน ท่านสามารถศึกษารายละเอียด
          เพิ่มเติมของ Cookies ได้จาก https://www.allaboutcookies.org/
        </p>

        <h2 className="text-center sm:text-left text-3xl text-white font-bold mt-12">
          เราใช้ Cookies อย่างไร ?
        </h2>
        <p className="sm:text-lg text-white/80 mt-4">
          เราจะจัดเก็บข้อมูลการเข้าเยี่ยมชมเว็บไซต์จากผู้เข้าเยี่ยมชมทุกรายผ่าน
          Cookies หรือ เทคโนโลยีที่ใกล้เคียง และเราใช้ Cookies
          เพื่อประโยชน์ในการพัฒนาประสิทธิภาพในการเข้าถึงบริการของเราผ่านระบบอินเตอร์เน็ต
          รวมถึงพัฒนาประสิทธิภาพในการใช้งานเว็บไซต์ โดยจะใช้เพื่อกรณี
          ดังต่อไปนี้
        </p>
        <ul className="list-decimal sm:text-lg text-white/80 pl-6 mt-4 leading-8 divide-y divide-gray-100/20">
          <li className="py-2">
            เพื่อให้ท่านสามารถเข้าสู่ระบบบัญชีของท่านในเว็บไซต์ของเราได้อย่างต่อเนื่อง
            และปลอดภัย
          </li>
          <li className="py-2">
            เพื่อศึกษาพฤติกรรมการใช้งานและเยี่ยมชมเว็บไซต์ของท่าน
            เพื่อปรับเนื้อหาให้ตรงกับความสนใจ
            และสามารถตอบสนองความต้องการของท่านมากขึ้น
          </li>
          <li className="py-2">
            เพื่อศึกษาพฤติกรรมของผู้เยี่ยมชมเว็บไซต์โดยรวม
            และนำไปพัฒนาให้สามารถใช้งานได้ง่าย รวดเร็ว และมีประสิทธิภาพยิ่งขึ้น
          </li>
        </ul>

        <h2 className="text-center sm:text-left text-3xl text-white font-bold mt-12">
          ประเภทของ Cookies ที่เราใช้
        </h2>
        <ul className="list-decimal sm:text-lg text-white/80 pl-6 mt-4 leading-8 divide-y divide-gray-100/20">
          <li className="py-2">
            เว็บไซต์ของเราประกอบไปด้วย Cookies ดังต่อไปนี้Functionality Cookies:
            คุกกี้ประกอบการทำงานของเว็บไซต์
            ถูกใช้ในการจดจำสิ่งที่ท่านเลือกหรือตั้งค่าบนเว็บไซต์
            รวมถึงการนำเสนอข้อมูลที่ตรงความต้องการ เฉพาะบุคคลมากขึ้น เช่น
            ชื่อบัญชีผู้ใช้ ภาษา ฟ้อนต์ และรูปแบบเว็บไซต์
          </li>
          <li className="py-2">
            Advertising Cookies: คุกกี้สำหรับการโฆษณา
            ใช้ในการจดจำสิ่งที่ท่านเคยเยี่ยมชมและรวมถึงลักษณะการใช้เว็บไซต์ของท่าน
            เพื่อนำเสนอสินค้า บริการ หรือ
            สื่อโฆษณาที่เกี่ยวข้องและตรงกับความสนใจของท่าน
            และใช้เพื่อการประเมินประสิทธิผลของแคมเปญโฆษณาต่าง ๆ
          </li>
          <li className="py-2">
            Strictly Necessary Cookies: คุกกี้ทางเทคนิค
            เป็นประเภทคุกกี้ที่มีความจำเป็นต่อการใช้งานเว็บไซต์ทำให้ท่านสามารถเข้าถึงข้อมูลได้อย่างทั่วถึงและปลอดภัย
          </li>
          <li className="py-2">
            Performance Cookies: คุกกี้เพื่อวัดผลการทำงานของเว็บไซต์
            คุกกี้ประเภทนี้จะจัดเก็บข้อมูลของผู้เข้าชมเว็บไซต์แบบไม่ระบุตัวตน
            และนำมาวิเคราะห์จำนวนและพฤติกรรมของผู้เข้าชม
            เพื่อปรับปรุงเว็บไซต์ให้มีประสิทธิภาพและตรงกับความต้องการของผู้ใช้มากขึ้น
          </li>
          <li className="py-2">
            Third-party Cookies: คุกกี้บุคคลที่สาม
            คุกกี้ชนิดนี้จะถูกกำหนดใช้โดยผู้บริการซึ่งเป็นบุคคลที่สาม อาทิ
            Google Analytics, Facebook Pixels, Hotjar
          </li>
        </ul>

        <h2 className="text-center sm:text-left text-3xl text-white font-bold mt-12">
          การตั้งค่าคุกกี้
        </h2>
        <ul className="list-decimal sm:text-lg text-white/80 pl-6 mt-4 leading-8 divide-y divide-gray-100/20">
          <li className="py-2">
            ท่านสามารถตั้งค่าเพื่อปฏิเสธการใช้การคุกกี้ในบราวเซอร์ของท่านได้
            โดยมีขั้นตอนในการจัดการดังนี้:
            <p>สำหรับผู้ใช้ระบบซาฟารี (Safari)</p>
            <ul className="list-disc pl-4">
              <li>เข้าแอพพลิเคชั่นซาฟารีและเลือก “การตั้งค่า”</li>
              <li>
                เลือก “ความเป็นส่วนตัว”
                และจัดการข้อมูลการใช้คุกกี้ตามความต้องการของท่านดังนี้
              </li>
              <ul>
                <li>
                  1. เลือก “ป้องกันไม่ให้ติดตามข้ามไซต์”
                  เพื่อยกเลิกตัวติดตามใช้คุกกี้และข้อมูลเว็บไซต์
                </li>
                <li>
                  2. เลือก “ปิดกั้นคุกกี้ทั้งหมด”
                  เพื่อปิดกั้นไม่ให้เว็บไซต์บุคคลที่สามและผู้โฆษณาจัดเก็บข้อมูลต่าง
                  ๆ ไว้บนเครื่องคอมพิวเตอร์ของคุณ
                </li>
                <li>
                  3. เลือก “จัดการข้อมูลเว็บไซต์”
                  เพื่อดูว่าเว็บไซต์ใดบ้างที่จัดเก็บคุกกี้และข้อมูลของท่าน
                </li>
              </ul>
            </ul>
          </li>
          <li className="py-2">
            สำหรับผู้ใช้กูเกิ้ลโครม (Google Chrome)
            <ul className="list-disc pl-4">
              <li>
                เข้าระบบกูเกิ้ลโครมในคอมพิวเตอร์ และเลือก “การตั้งค่า” ด้านขวาบน
              </li>
              <li>เลือก “ขั้นสูง” ด้านล่าง</li>
              <li>เลือก “การตั้งค่าและความปลอดภัย”</li>
              <li>เลือก “การตั้งค่าเว็บไซต์”</li>
              <li>คลิก “คุกกี้”</li>
              <li>
                หากต้องการยกเลิกการใช้คุกกี้ เลือก
                “ปิดการอนุญาตให้เว็บไซต์บันทึกและอ่านข้อมูลคุกกี้”
              </li>
            </ul>
          </li>
          <li className="py-2">
            สำหรับผู้ใช้ Internet Explorer
            <ul className="pl-4 list-disc">
              <li>เมื่อเข้าระบบ Internet Explorer เลือก “การตั้งค่า”</li>
              <li>หากต้องการลบข้อมูลคุกกี้:</li>
              <ul className="pl-4 list-decimal">
                <li>เลือก “ความปลอดภัย”</li>
                <li>เลือก “ลบประวัติการเรียกดู”</li>
                <li>เลือก “คุกกี้และข้อมูลเว็บไซต์” และกด “ลบ”</li>
              </ul>
              <li>หากต้องการลบข้อมูลคุกกี้:</li>
              <ul className="pl-4 list-decimal">
                <li>เลือก “เครื่องมือ”</li>
                <li>เลือก “ตัวเลือกอินเทอร์เน็ต”</li>
                <li>เลือก “ความเป็นส่วนตัว”</li>
                <li>กด “ขั้นสูง” และเลือกให้อนุญาตหรือบล็อกคุกกี้</li>
              </ul>
            </ul>
          </li>
        </ul>

        <h2 className="text-center sm:text-left text-3xl text-white font-bold mt-12">
          นโยบายคุ้มครองข้อมูลส่วนบุคคลของเว็บไซต์อื่น
        </h2>
        <p className="sm:text-lg text-white/80 mt-4">
          นโยบายความเป็นส่วนตัวฉบับนี้
          ใช้เฉพาะสำหรับการให้บริการของเราและการใช้งานเว็บไซต์ของเราเท่านั้น
          หากท่านได้กดลิงก์ไปยังเว็บไซต์อื่น
          แม้จะผ่านช่องทางในเว็บไซต์ของเราก็ตาม
          ท่านจะต้องศึกษาและปฏิบัติตามนโยบายความเป็นส่วนตัวที่ปรากฏในเว็บไซต์นั้น
          ๆ แยกจากของเว็บไซต์ของเราอย่างสิ้นเชิง
        </p>

        <h2 className="text-center sm:text-left text-3xl text-white font-bold mt-12">
          การเปลี่ยนแปลงนโยบายคุ้มครองข้อมูลส่วนบุคคล
        </h2>
        <p className="sm:text-lg text-white/80 mt-4">
          เราจะทำการพิจารณาทบทวนนโยบายความเป็นส่วนตัวเป็นประจำเพื่อให้สอดคล้องกับแนวทางการปฏิบัติ
          และกฎหมายข้อบังคับที่เกี่ยวข้อง
          ทั้งนี้หากมีการเปลี่ยนแปลงนโยบายความเป็นส่วนตัว
          เราจะแจ้งให้ท่านทราบด้วยการปรับเปลี่ยนข้อมูลลงในเว็บไซต์ของเราโดยเร็วที่สุด
          ปัจจุบันนโยบายความเป็นส่วนตัวถูกทบทวนครั้งล่าสุดเมื่อ 04/09/2020
          และจะมีผลตั้งแต่วันที่ 07/09/2020
        </p>

        <h2 className="text-center sm:text-left text-3xl text-white font-bold mt-12">
          ช่องทางการติดต่อ
        </h2>

        <p className="sm:text-lg text-white/80 mt-4">
          ชื่อ: คณะเทคโนโลยีสารสนเทศ
          สถาบันเทคโนโลยีพระจอมเกล้าเจ้าคุณทหารลาดกระบัง
          <ul className="list-disc ml-4">
            <li>
              สถานที่ติดต่อ: เลขที่ 1 ซอยฉลองกรุง 1 แขวงลาดกระบัง เขตลาดกระบัง
              กรุงเทพฯ 10520
            </li>
            <li>อีเมล: support@itcamp18.in.th</li>
            <li>facebook: https://www.facebook.com/itcampKMITL</li>
          </ul>
        </p>
        <h2 className="text-center sm:text-left text-3xl text-white font-bold mt-12">
          ข้อมูลส่วนบุคคลที่จะทำการประมวลผล
        </h2>
        <p className="sm:text-lg mt-4 text-white/80">
          รายละเอียดปรากฏตามนโยบายคุ้มครองข้อมูลส่วนบุคคล หัวข้อ
          “ข้อมูลส่วนบุคคลที่เราเก็บรวบรวม” และ
          “ระยะเวลาในการเก็บรักษาข้อมูลส่วนบุคคล”
          วัตถุประสงค์และฐานในการประมวลผลข้อมูล
          รายละเอียดปรากฏตามนโยบายคุ้มครองข้อมูลส่วนบุคคล หัวข้อ
          “วัตถุประสงค์ในการประมวลผลข้อมูล”
          เราดำเนินการประมวลผลข้อมูลส่วนบุคคลของท่านภายใต้ฐาน ดังต่อไปนี้
        </p>
        <ul className="list-disc text-white/80 ml-4 mt-4">
          <li>
            ความยินยอม ตามที่ท่านได้ให้ความยินยอมเมื่อสมัครใช้บริการ
            ทั้งนี้หากท่านประสงค์จะถอนความยินยอม ท่านสามารถดำเนินการได้ดังนี้
            ท่านสามารถแจ้งเพิกถอนความยินยอมในการให้ใช้หรือเปิดเผยข้อมูลในวัตถุประสงค์หรือลักษณะใด
            ๆ ที่ได้ระบุไว้ข้างต้นได้ตลอดเวลา
            รวมถึงการร้องขอให้ลบหรือทำให้ข้อมูลส่วนบุคคลเป็นนิรนามได้
            โดยติดต่อเจ้าหน้าที่ป้องกันข้อมูลส่วนบุคคลซึ่งระบุเอาไว้ด้านบน
            แนวทางการถอนความยินยอมประกอบไปด้วย:
          </li>
          <ul className="list-disc">
            <li>ช่องทางอิเล็กทรอนิกส์ อาทิ อีเมล หรือ Facebook Fanpage</li>
            <li>แจ้งผ่านวาจา อาทิ โทรศัพท์ หรือ ต่อหน้าคณะผู้จัด</li>
          </ul>
        </ul>
        <p className="sm:text-lg mt-4 text-white/80">
          โดยเมื่อคณะผู้จัดได้รับคำร้องของท่านแล้ว
          จะทำการส่งต่อให้แก่ฝ่ายบริหารจัดการข้อมูลเพื่อดำเนินการในขั้นตอนต่อไป
          ทั้งนี้การถอนความยินยอมจะไม่ส่งผลกระทบต่อการประมวลผลข้อมูลส่วนบุคคลที่ท่านได้ให้ความยินยอมไปแล้วโดยชอบด้วยกฎหมาย
          นอกจากนี้ผลกระทบจากการถอนความยินยอม มีดังนี้
        </p>
        <p className="sm:text-lg mt-4 text-white/80">
          หากท่านได้แจ้งเพิกถอนความยินยอมในการให้ใช้หรือเปิดเผยข้อมูลส่วนบุคคล
          ทางบริษัทอาจไม่สามารถให้บริการหรือดำเนินการซื้อขายสินค้าแก่ท่าน
          บริษัทมีสิทธิตามกฎหมายและขอสงวนไว้ซึ่งสิทธิดังกล่าว
        </p>
        <p className="sm:text-lg mt-4 text-white/80">
          ทั้งนี้ทางผู้ให้บริการไม่สามารถเก็บข้อมูลส่วนบุคคลของท่านหากไม่ได้รับการยินยอม
          เว้นแต่เพื่อวัตถุประสงค์ต่อไปนี้
        </p>
        <ul className="list-disc ml-4 mt-4 text-white/80">
          <li>
            เพื่อผลประโยชน์สำคัญจำเป็น เพื่อระงับหรือป้องกันอันตรายต่อชีวิต
            สุขภาพ หรือร่างกายของบุคคล
          </li>
          <li>เพื่อจัดทำเอกสารทางประวัติศาสตร์ จดหมายเหตุ การวิจัยหรือสถิติ</li>
          <li>
            เพื่อการปฎิบัติตามพันธะสัญญาซึ่งเจ้าของข้อมูลส่วนบุคคลเป็นคู่สัญญา
          </li>
          <li>
            เพื่อดำเนินงานตามระเบียบหรือกฎหมายของภาครัฐ
            หรือการใช้อำนาจรัฐของผู้ควบคุมส่วนบุคคล
          </li>
          <li>
            เพื่อประโยชน์โดยชอบด้วยกฎหมายของผู้ให้บริการ
            ผู้ควบคุมข้อมูลส่วนบุคคล หรือนิติบุคคลอื่น
            เว้นแต้ประโยชน์ดังกล่าวมีความสำคัญน้อยกว่าสิทธิขั้นพื้นฐานในการให้ข้อมูลส่วนบุคคล
          </li>
          <li>เพื่อประโยชน์สาธารณะของผู้ควบคุมข้อมูลส่วนบุคคล</li>
        </ul>
        <h2 className="text-center sm:text-left text-3xl text-white font-bold mt-12">
          แหล่งที่มาของข้อมูลส่วนบุคคล
        </h2>
        <ul className="list-disc pl-3 mt-4 text-white/80">
          <li>
            เราได้รับข้อมูลส่วนบุคคลของท่าน
            จากกรณีดังนี้เมื่อท่านได้เข้าถึงหรือใช้บริการเว็บไซต์ของเรา
            ลงทะเบียน หรือสมัครบัญชีผู้ใช้กับเรา
          </li>
          <li>
            เมื่อท่านส่งแบบฟอร์ม รวมถึงแบบฟอร์มการสมัครหรือแบบฟอร์มอื่น ๆ
            ที่เกี่ยวข้องกับโครงการของเรา
            ไม่ว่าจะเป็นรูปแบบออนไลน์หรือรูปแบบเอกสาร
          </li>
          <li>
            เมื่อท่านทำข้อตกลงใด ๆ
            หรือให้เอกสารหรือข้อมูลอื่นใดที่เกี่ยวข้องกับการติดต่อระหว่างท่านกับเรา
            หรือเมื่อท่านสมัครเข้าร่วมโครงการ ฯ กับเรา
          </li>
          <li>
            เมื่อท่านติดต่อกับเรา เช่น ผ่านทางโทรศัพท์ จดหมาย การประชุม
            การติดต่อผ่านเว็บไซต์สื่อทางสังคม และอีเมล
          </li>
          <li>
            เมื่อท่านใช้บริการเว็บไซต์ของเรา ซึ่งรวมถึงแต่ไม่จำกัดเพียง
            การใช้ผ่านคุกกี้ ซึ่งเราอาจปรับใช้เมื่อท่านได้เข้าถึงเว็บไซต์
          </li>
          <li>เมื่อท่านแสดงความคิดเห็นหรือส่งคำร้องเรียนแก่เรา</li>
          <li>เมื่อท่านลงทะเบียนเข้าร่วมเป็นผู้สมัครโครงการ ฯ</li>
          <li>เมื่อท่านเข้าเยี่ยมชมหรือใช้เว็บไซต์ของเรา</li>
          <li>เมื่อท่านเชื่อมต่อบัญชีของท่านกับเว็บไซต์ของเรา</li>
          <li>เมื่อท่านส่งข้อมูลส่วนบุคคลของท่านให้แก่เราด้วยเหตุผลใดก็ตาม</li>
        </ul>
        <p className="sm:text-lg text-white/80 mt-4">
          ท่านมีสิทธิในการดำเนินการ ดังต่อไปนี้
        </p>
        <h2 className="text-center sm:text-left text-3xl text-white font-bold mt-12">
          การประมวลผลข้อมูลส่วนบุคคล
        </h2>
        <p className="sm:text-lg text-white/80 mt-4">
          รายละเอียดปรากฏตามนโยบายคุ้มครองข้อมูลส่วนบุคคล หัวข้อ
          “การประมวลผลข้อมูลส่วนบุคคล”
        </p>
        <h2 className="text-center sm:text-left text-3xl text-white font-bold mt-12">
          การเก็บรักษาข้อมูลส่วนบุคคล
        </h2>
        <p className="sm:text-lg text-white/80 mt-4">
          รายละเอียดปรากฏตามนโยบายคุ้มครองข้อมูลส่วนบุคคล หัวข้อ
          “การเก็บรักษาข้อมูลส่วนบุคคล”
        </p>
        <h2 className="text-center sm:text-left text-3xl text-white font-bold mt-12">
          สิทธิของเจ้าของข้อมูล
        </h2>
        <p className="sm:text-lg text-white/80 mt-4">
          รายละเอียดปรากฏตามนโยบายคุ้มครองข้อมูลส่วนบุคคล เรื่อง
          “สิทธิของเจ้าของข้อมูล”
        </p>
      </div>
    </div>
  );
};

export default Cookie;
